/**
 *
 * 这是由 LeetCode 官方推出的的经典面试题目清单，我们将题目重新整理规划，从而为大家提供更好的练习体验和帮助大家找到理想的工作。 我们将题目分为以下三个部分：
 *
 * 初级算法 - 帮助入门
 * 中级算法 - 巩固训练
 * 高级算法 - 提升进阶
 * 这一系列 LeetBook 将帮助您掌握算法及数据结构，并提高您的编程能力。
 *
 * 编程能力就像任何其他技能一样，也是一个可以通过 刻意练习 大大提高的。
 *
 * 大多数经典面试题目都有多种解决方案。 为了达到最佳的练习效果，我们强烈建议您至少将此清单里的题目练习两遍，如果可以的话，三遍会更好。
 *
 * 在第二遍练习时，你可能会发现一些新的技巧或新的方法。 到第三遍的时候，你会发现你的代码要比第一次提交时更加简洁。 如果你达到了这样的效果，那么恭喜你，你已经掌握了正确的练习方法！
 *
 * 记住：刻意练习并不意味着寻找答案并记住它，这种练习方法不是长久之计。 在没有参考答案情况下，越能自主解决问题，才越能提高自身能力。
 *
 * 作者：力扣 (LeetCode)
 * 链接：https://leetcode-cn.com/leetbook/read/top-interview-questions-medium/x6vk7r/
 * 来源：力扣（LeetCode）
 * 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
 *
 * @author li.bowei
 */
package org.ilmostro.basic.leetcode.middle;